load-test/results/network-chaos/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/laratidesco/Documents/trabalho_sistemas_distribuidos/load-test/k6-script.js
        output: json (/Users/laratidesco/Documents/trabalho_sistemas_distribuidos/load-test/results/network-chaos/k6-metrics.json)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 2m30s max duration (incl. graceful stop):
              * constant_load: 5 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
constant_load   [   1% ] 5 VUs  0m01.0s/2m0s

running (0m02.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m02.0s/2m0s

running (0m03.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m03.0s/2m0s

running (0m04.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  0m04.0s/2m0s

running (0m05.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
constant_load   [   4% ] 5 VUs  0m05.0s/2m0s

running (0m06.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m06.0s/2m0s

running (0m07.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
constant_load   [   6% ] 5 VUs  0m07.0s/2m0s

running (0m08.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m08.0s/2m0s

running (0m09.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m09.0s/2m0s

running (0m10.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
constant_load   [   8% ] 5 VUs  0m10.0s/2m0s

running (0m11.0s), 5/5 VUs, 97 complete and 0 interrupted iterations
constant_load   [   9% ] 5 VUs  0m11.0s/2m0s

running (0m12.0s), 5/5 VUs, 106 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m12.0s/2m0s

running (0m13.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
constant_load   [  11% ] 5 VUs  0m13.0s/2m0s

running (0m14.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m14.0s/2m0s

running (0m15.0s), 5/5 VUs, 132 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m15.0s/2m0s

running (0m16.0s), 5/5 VUs, 141 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  0m16.0s/2m0s

running (0m17.0s), 5/5 VUs, 151 complete and 0 interrupted iterations
constant_load   [  14% ] 5 VUs  0m17.0s/2m0s

running (0m18.0s), 5/5 VUs, 157 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m18.0s/2m0s

running (0m19.0s), 5/5 VUs, 167 complete and 0 interrupted iterations
constant_load   [  16% ] 5 VUs  0m19.0s/2m0s

running (0m20.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m20.0s/2m0s

running (0m21.0s), 5/5 VUs, 183 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m21.0s/2m0s

running (0m22.0s), 5/5 VUs, 193 complete and 0 interrupted iterations
constant_load   [  18% ] 5 VUs  0m22.0s/2m0s

running (0m23.0s), 5/5 VUs, 202 complete and 0 interrupted iterations
constant_load   [  19% ] 5 VUs  0m23.0s/2m0s

running (0m24.0s), 5/5 VUs, 210 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m24.0s/2m0s

running (0m25.0s), 5/5 VUs, 220 complete and 0 interrupted iterations
constant_load   [  21% ] 5 VUs  0m25.0s/2m0s

running (0m26.0s), 5/5 VUs, 229 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m26.0s/2m0s

running (0m27.0s), 5/5 VUs, 239 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m27.0s/2m0s

running (0m28.0s), 5/5 VUs, 247 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  0m28.0s/2m0s

running (0m29.0s), 5/5 VUs, 255 complete and 0 interrupted iterations
constant_load   [  24% ] 5 VUs  0m29.0s/2m0s

running (0m30.0s), 5/5 VUs, 263 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  0m30.0s/2m0s

running (0m31.0s), 5/5 VUs, 272 complete and 0 interrupted iterations
constant_load   [  26% ] 5 VUs  0m31.0s/2m0s

running (0m32.0s), 5/5 VUs, 272 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  0m32.0s/2m0s

running (0m33.0s), 5/5 VUs, 273 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  0m33.0s/2m0s

running (0m34.0s), 5/5 VUs, 275 complete and 0 interrupted iterations
constant_load   [  28% ] 5 VUs  0m34.0s/2m0s

running (0m35.0s), 5/5 VUs, 276 complete and 0 interrupted iterations
constant_load   [  29% ] 5 VUs  0m35.0s/2m0s

running (0m36.0s), 5/5 VUs, 277 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  0m36.0s/2m0s

running (0m37.0s), 5/5 VUs, 277 complete and 0 interrupted iterations
constant_load   [  31% ] 5 VUs  0m37.0s/2m0s

running (0m38.0s), 5/5 VUs, 278 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  0m38.0s/2m0s

running (0m39.0s), 5/5 VUs, 279 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  0m39.0s/2m0s

running (0m40.0s), 5/5 VUs, 279 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  0m40.0s/2m0s

running (0m41.0s), 5/5 VUs, 282 complete and 0 interrupted iterations
constant_load   [  34% ] 5 VUs  0m41.0s/2m0s

running (0m42.0s), 5/5 VUs, 282 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  0m42.0s/2m0s

running (0m43.0s), 5/5 VUs, 282 complete and 0 interrupted iterations
constant_load   [  36% ] 5 VUs  0m43.0s/2m0s

running (0m44.0s), 5/5 VUs, 285 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  0m44.0s/2m0s

running (0m45.0s), 5/5 VUs, 285 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  0m45.0s/2m0s

running (0m46.0s), 5/5 VUs, 287 complete and 0 interrupted iterations
constant_load   [  38% ] 5 VUs  0m46.0s/2m0s

running (0m47.0s), 5/5 VUs, 287 complete and 0 interrupted iterations
constant_load   [  39% ] 5 VUs  0m47.0s/2m0s

running (0m48.0s), 5/5 VUs, 288 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  0m48.0s/2m0s

running (0m49.0s), 5/5 VUs, 288 complete and 0 interrupted iterations
constant_load   [  41% ] 5 VUs  0m49.0s/2m0s

running (0m50.0s), 5/5 VUs, 290 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  0m50.0s/2m0s

running (0m51.0s), 5/5 VUs, 292 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  0m51.0s/2m0s

running (0m52.0s), 5/5 VUs, 292 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  0m52.0s/2m0s

running (0m53.0s), 5/5 VUs, 294 complete and 0 interrupted iterations
constant_load   [  44% ] 5 VUs  0m53.0s/2m0s

running (0m54.0s), 5/5 VUs, 294 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  0m54.0s/2m0s

running (0m55.0s), 5/5 VUs, 294 complete and 0 interrupted iterations
constant_load   [  46% ] 5 VUs  0m55.0s/2m0s

running (0m56.0s), 5/5 VUs, 295 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  0m56.0s/2m0s

running (0m57.0s), 5/5 VUs, 295 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  0m57.0s/2m0s

running (0m58.0s), 5/5 VUs, 297 complete and 0 interrupted iterations
constant_load   [  48% ] 5 VUs  0m58.0s/2m0s

running (0m59.0s), 5/5 VUs, 299 complete and 0 interrupted iterations
constant_load   [  49% ] 5 VUs  0m59.0s/2m0s

running (1m00.0s), 5/5 VUs, 300 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  1m00.0s/2m0s

running (1m01.0s), 5/5 VUs, 302 complete and 0 interrupted iterations
constant_load   [  51% ] 5 VUs  1m01.0s/2m0s

running (1m02.0s), 5/5 VUs, 302 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  1m02.0s/2m0s

running (1m03.0s), 5/5 VUs, 303 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  1m03.0s/2m0s

running (1m04.0s), 5/5 VUs, 303 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  1m04.0s/2m0s

running (1m05.0s), 5/5 VUs, 303 complete and 0 interrupted iterations
constant_load   [  54% ] 5 VUs  1m05.0s/2m0s

running (1m06.0s), 5/5 VUs, 304 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  1m06.0s/2m0s

running (1m07.0s), 5/5 VUs, 304 complete and 0 interrupted iterations
constant_load   [  56% ] 5 VUs  1m07.0s/2m0s

running (1m08.0s), 5/5 VUs, 305 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  1m08.0s/2m0s

running (1m09.0s), 5/5 VUs, 305 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  1m09.0s/2m0s

running (1m10.0s), 5/5 VUs, 308 complete and 0 interrupted iterations
constant_load   [  58% ] 5 VUs  1m10.0s/2m0s

running (1m11.0s), 5/5 VUs, 308 complete and 0 interrupted iterations
constant_load   [  59% ] 5 VUs  1m11.0s/2m0s

running (1m12.0s), 5/5 VUs, 308 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  1m12.0s/2m0s

running (1m13.0s), 5/5 VUs, 308 complete and 0 interrupted iterations
constant_load   [  61% ] 5 VUs  1m13.0s/2m0s

running (1m14.0s), 5/5 VUs, 309 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  1m14.0s/2m0s

running (1m15.0s), 5/5 VUs, 310 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  1m15.0s/2m0s

running (1m16.0s), 5/5 VUs, 310 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  1m16.0s/2m0s

running (1m17.0s), 5/5 VUs, 310 complete and 0 interrupted iterations
constant_load   [  64% ] 5 VUs  1m17.0s/2m0s

running (1m18.0s), 5/5 VUs, 312 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  1m18.0s/2m0s

running (1m19.0s), 5/5 VUs, 312 complete and 0 interrupted iterations
constant_load   [  66% ] 5 VUs  1m19.0s/2m0s

running (1m20.0s), 5/5 VUs, 313 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  1m20.0s/2m0s

running (1m21.0s), 5/5 VUs, 313 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  1m21.0s/2m0s

running (1m22.0s), 5/5 VUs, 314 complete and 0 interrupted iterations
constant_load   [  68% ] 5 VUs  1m22.0s/2m0s

running (1m23.0s), 5/5 VUs, 314 complete and 0 interrupted iterations
constant_load   [  69% ] 5 VUs  1m23.0s/2m0s

running (1m24.0s), 5/5 VUs, 316 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  1m24.0s/2m0s

running (1m25.0s), 5/5 VUs, 316 complete and 0 interrupted iterations
constant_load   [  71% ] 5 VUs  1m25.0s/2m0s

running (1m26.0s), 5/5 VUs, 317 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  1m26.0s/2m0s

running (1m27.0s), 5/5 VUs, 318 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  1m27.0s/2m0s

running (1m28.0s), 5/5 VUs, 319 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  1m28.0s/2m0s

running (1m29.0s), 5/5 VUs, 321 complete and 0 interrupted iterations
constant_load   [  74% ] 5 VUs  1m29.0s/2m0s

running (1m30.0s), 5/5 VUs, 322 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  1m30.0s/2m0s

running (1m31.0s), 5/5 VUs, 326 complete and 0 interrupted iterations
constant_load   [  76% ] 5 VUs  1m31.0s/2m0s

running (1m32.0s), 5/5 VUs, 331 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  1m32.0s/2m0s

running (1m33.0s), 5/5 VUs, 339 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  1m33.0s/2m0s

running (1m34.0s), 5/5 VUs, 348 complete and 0 interrupted iterations
constant_load   [  78% ] 5 VUs  1m34.0s/2m0s

running (1m35.0s), 5/5 VUs, 358 complete and 0 interrupted iterations
constant_load   [  79% ] 5 VUs  1m35.0s/2m0s

running (1m36.0s), 5/5 VUs, 366 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  1m36.0s/2m0s

running (1m37.0s), 5/5 VUs, 375 complete and 0 interrupted iterations
constant_load   [  81% ] 5 VUs  1m37.0s/2m0s

running (1m38.0s), 5/5 VUs, 385 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  1m38.0s/2m0s

running (1m39.0s), 5/5 VUs, 395 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  1m39.0s/2m0s

running (1m40.0s), 5/5 VUs, 404 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  1m40.0s/2m0s

running (1m41.0s), 5/5 VUs, 412 complete and 0 interrupted iterations
constant_load   [  84% ] 5 VUs  1m41.0s/2m0s

running (1m42.0s), 5/5 VUs, 421 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  1m42.0s/2m0s

running (1m43.0s), 5/5 VUs, 431 complete and 0 interrupted iterations
constant_load   [  86% ] 5 VUs  1m43.0s/2m0s

running (1m44.0s), 5/5 VUs, 441 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  1m44.0s/2m0s

running (1m45.0s), 5/5 VUs, 449 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  1m45.0s/2m0s

running (1m46.0s), 5/5 VUs, 459 complete and 0 interrupted iterations
constant_load   [  88% ] 5 VUs  1m46.0s/2m0s

running (1m47.0s), 5/5 VUs, 468 complete and 0 interrupted iterations
constant_load   [  89% ] 5 VUs  1m47.0s/2m0s

running (1m48.0s), 5/5 VUs, 477 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  1m48.0s/2m0s

running (1m49.0s), 5/5 VUs, 486 complete and 0 interrupted iterations
constant_load   [  91% ] 5 VUs  1m49.0s/2m0s

running (1m50.0s), 5/5 VUs, 493 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  1m50.0s/2m0s

running (1m51.0s), 5/5 VUs, 503 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  1m51.0s/2m0s

running (1m52.0s), 5/5 VUs, 510 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  1m52.0s/2m0s

running (1m53.0s), 5/5 VUs, 517 complete and 0 interrupted iterations
constant_load   [  94% ] 5 VUs  1m53.0s/2m0s

running (1m54.0s), 5/5 VUs, 526 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  1m54.0s/2m0s

running (1m55.0s), 5/5 VUs, 535 complete and 0 interrupted iterations
constant_load   [  96% ] 5 VUs  1m55.0s/2m0s

running (1m56.0s), 5/5 VUs, 544 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  1m56.0s/2m0s

running (1m57.0s), 5/5 VUs, 553 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  1m57.0s/2m0s

running (1m58.0s), 5/5 VUs, 563 complete and 0 interrupted iterations
constant_load   [  98% ] 5 VUs  1m58.0s/2m0s

running (1m59.0s), 5/5 VUs, 572 complete and 0 interrupted iterations
constant_load   [  99% ] 5 VUs  1m59.0s/2m0s

running (2m00.0s), 5/5 VUs, 582 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  2m00.0s/2m0s


  █ TOTAL RESULTS 

    checks_total.......: 587    4.861223/s
    checks_succeeded...: 98.80% 580 out of 587
    checks_failed......: 1.19%  7 out of 587

    ✗ list status is not 5xx
      ↳  99% — ✓ 396 / ✗ 4
    ✗ get status is not 5xx
      ↳  98% — ✓ 121 / ✗ 2
    ✗ create status is not 5xx
      ↳  98% — ✓ 63 / ✗ 1

    HTTP
    http_req_duration..............: avg=524.77ms min=3.91ms   med=33.71ms  max=15.54s p(90)=308.26ms p(95)=3.46s
      { expected_response:true }...: avg=490.02ms min=3.91ms   med=33.58ms  max=15.54s p(90)=259.84ms p(95)=3.33s
    http_req_failed................: 1.19% 7 out of 587
    http_reqs......................: 587   4.861223/s

    EXECUTION
    iteration_duration.............: avg=1.02s    min=504.23ms med=534.68ms max=16.04s p(90)=809.16ms p(95)=3.97s
    iterations.....................: 587   4.861223/s
    vus............................: 5     min=5        max=5
    vus_max........................: 5     min=5        max=5

    NETWORK
    data_received..................: 30 MB 246 kB/s
    data_sent......................: 53 kB 435 B/s



running (2m00.8s), 0/5 VUs, 587 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 5 VUs  2m0s